Revit 2027 API
RepeaterCoordinates.GetCoordinate Method
 Returns the coordinate in the given dimension.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetCoordinate(
	int dimension
)
Public Function GetCoordinate (
	dimension As Integer
) As Integer
public:
int GetCoordinate(
	int dimension
)
member GetCoordinate :
        dimension : int -> int
Parameters
dimension Int32
 The dimension.
Return Value
Int32
 The coordinate.
Exceptions
Exception | Condition
ArgumentException |  The dimension is invalid for these coordinates.
InvalidOperationException |  The coordinates must have at least one dimension.
Remarks
 The dimension begins at 0 and must be in the range [0, number of dimensions in the bounds - 1]. This method does not apply to zero dimensional coordinates.
See Also
Reference
RepeaterCoordinates Class
Autodesk.Revit.DB Namespace